## Lab 2: Getting to grips with Pandas DataFrames and Series

#### Task 1:

In [1]:
import pandas as pd

df = pd.read_csv('train.csv')

id_values = pd.Series(df['PassengerId'])

print(id_values)

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

#### Task 2

In [2]:
id_values.mean()

446.0

In [3]:
id_values.median()

446.0

#### Task 3

In [4]:
print(id_values.min(), id_values.max())

1 891

#### Task 4

In [5]:
copied_df = df.copy()

#### Task 5

In [23]:
rand_remove = copied_df.sample()

display(rand_remove)

test = copied_df.drop(rand_remove.index)

test.iloc[rand_remove.index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
398,399,0,2,"Pain, Dr. Alfred",male,23.0,0,0,244278,10.5,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
399,400,1,2,"Trout, Mrs. William H (Jessie L)",female,28.0,0,0,240929,12.65,NaN,S

#### Task 6

In [24]:
rand_record = copied_df.sample()

display(rand_record)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C

#### Task 7

In [39]:
add_person = pd.Series([901, 1 , 1 , 'Thrasher Kurtis', 'male', 21, 0 , 0, 233333, 10.5, 1, 'P'], index=copied_df.columns)

add_series = copied_df.append(add_person , ignore_index=True)


add_series

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
891,901,1,1,Thrasher Kurtis,male,21.0,0,0,233333,10.5000,1,P